DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-SPI-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| SPI_CR2 - SPI control register 2
+---------------------------------------------------------------------------------------------------------------------*/

#define SPI_CR2_TXEIE_bit					7
#define SPI_CR2_RXNEIE_bit					6
#define SPI_CR2_ERRIE_bit					5
#define SPI_CR2_FRF_bit						4
#define SPI_CR2_SSOE_bit					2
#define SPI_CR2_TXDMAEN_bit					1
#define SPI_CR2_RXDMAEN_bit					0

#define SPIx_CR2_TXEIE_bb(base)				BITBAND(&(base)->CR2, SPI_CR2_TXEIE_bit)
#define SPIx_CR2_RXNEIE_bb(base)			BITBAND(&(base)->CR2, SPI_CR2_RXNEIE_bit)
#define SPIx_CR2_ERRIE_bb(base)				BITBAND(&(base)->CR2, SPI_CR2_ERRIE_bit)
#define SPIx_CR2_FRF_bb(base)				BITBAND(&(base)->CR2, SPI_CR2_FRF_bit)
#define SPIx_CR2_SSOE_bb(base)				BITBAND(&(base)->CR2, SPI_CR2_SSOE_bit)
#define SPIx_CR2_TXDMAEN_bb(base)			BITBAND(&(base)->CR2, SPI_CR2_TXDMAEN_bit)
#define SPIx_CR2_RXDMAEN_bb(base)			BITBAND(&(base)->CR2, SPI_CR2_RXDMAEN_bit)

#define SPI1_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI1)
#define SPI1_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI1)
#define SPI1_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI1)
#define SPI1_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI1)
#define SPI1_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI1)
#define SPI1_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI1)
#define SPI1_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI1)

#define SPI2_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI2)
#define SPI2_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI2)
#define SPI2_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI2)
#define SPI2_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI2)
#define SPI2_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI2)
#define SPI2_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI2)
#define SPI2_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI2)

#define SPI3_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI3)
#define SPI3_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI3)
#define SPI3_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI3)
#define SPI3_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI3)
#define SPI3_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI3)
#define SPI3_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI3)
#define SPI3_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI3)

#define SPI4_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI4)
#define SPI4_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI4)
#define SPI4_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI4)
#define SPI4_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI4)
#define SPI4_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI4)
#define SPI4_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI4)
#define SPI4_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI4)

#define SPI5_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI5)
#define SPI5_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI5)
#define SPI5_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI5)
#define SPI5_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI5)
#define SPI5_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI5)
#define SPI5_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI5)
#define SPI5_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI5)

#define SPI6_CR2_TXEIE_bb					SPIx_CR2_TXEIE_bb(SPI6)
#define SPI6_CR2_RXNEIE_bb					SPIx_CR2_RXNEIE_bb(SPI6)
#define SPI6_CR2_ERRIE_bb					SPIx_CR2_ERRIE_bb(SPI6)
#define SPI6_CR2_FRF_bb						SPIx_CR2_FRF_bb(SPI6)
#define SPI6_CR2_SSOE_bb					SPIx_CR2_SSOE_bb(SPI6)
#define SPI6_CR2_TXDMAEN_bb					SPIx_CR2_TXDMAEN_bb(SPI6)
#define SPI6_CR2_RXDMAEN_bb					SPIx_CR2_RXDMAEN_bb(SPI6)

/*---------------------------------------------------------------------------------------------------------------------+
| SPI_SR - SPI status register
+---------------------------------------------------------------------------------------------------------------------*/

#define SPI_SR_FRE_bit						8
#define SPI_SR_BSY_bit						7
#define SPI_SR_OVR_bit						6
#define SPI_SR_MODF_bit						5
#define SPI_SR_CRCERR_bit					4
#define SPI_SR_UDR_bit						3
#define SPI_SR_CHSIDE_bit					2
#define SPI_SR_TXE_bit						1
#define SPI_SR_RXNE_bit						0

#define SPIx_SR_FRE_bb(base)				BITBAND(&(base)->SR, SPI_SR_FRE_bit)
#define SPIx_SR_BSY_bb(base)				BITBAND(&(base)->SR, SPI_SR_BSY_bit)
#define SPIx_SR_OVR_bb(base)				BITBAND(&(base)->SR, SPI_SR_OVR_bit)
#define SPIx_SR_MODF_bb(base)				BITBAND(&(base)->SR, SPI_SR_MODF_bit)
#define SPIx_SR_CRCERR_bb(base)				BITBAND(&(base)->SR, SPI_SR_CRCERR_bit)
#define SPIx_SR_UDR_bb(base)				BITBAND(&(base)->SR, SPI_SR_UDR_bit)
#define SPIx_SR_CHSIDE_bb(base)				BITBAND(&(base)->SR, SPI_SR_CHSIDE_bit)
#define SPIx_SR_TXE_bb(base)				BITBAND(&(base)->SR, SPI_SR_TXE_bit)
#define SPIx_SR_RXNE_bb(base)				BITBAND(&(base)->SR, SPI_SR_RXNE_bit)

#define SPI1_SR_FRE_bb						SPIx_SR_FRE_bb(SPI1)
#define SPI1_SR_BSY_bb						SPIx_SR_BSY_bb(SPI1)
#define SPI1_SR_OVR_bb						SPIx_SR_OVR_bb(SPI1)
#define SPI1_SR_MODF_bb						SPIx_SR_MODF_bb(SPI1)
#define SPI1_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI1)
#define SPI1_SR_UDR_bb						SPIx_SR_UDR_bb(SPI1)
#define SPI1_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI1)
#define SPI1_SR_TXE_bb						SPIx_SR_TXE_bb(SPI1)
#define SPI1_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI1)

#define SPI2_SR_FRE_bb						SPIx_SR_FRE_bb(SPI2)
#define SPI2_SR_BSY_bb						SPIx_SR_BSY_bb(SPI2)
#define SPI2_SR_OVR_bb						SPIx_SR_OVR_bb(SPI2)
#define SPI2_SR_MODF_bb						SPIx_SR_MODF_bb(SPI2)
#define SPI2_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI2)
#define SPI2_SR_UDR_bb						SPIx_SR_UDR_bb(SPI2)
#define SPI2_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI2)
#define SPI2_SR_TXE_bb						SPIx_SR_TXE_bb(SPI2)
#define SPI2_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI2)

#define SPI3_SR_FRE_bb						SPIx_SR_FRE_bb(SPI3)
#define SPI3_SR_BSY_bb						SPIx_SR_BSY_bb(SPI3)
#define SPI3_SR_OVR_bb						SPIx_SR_OVR_bb(SPI3)
#define SPI3_SR_MODF_bb						SPIx_SR_MODF_bb(SPI3)
#define SPI3_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI3)
#define SPI3_SR_UDR_bb						SPIx_SR_UDR_bb(SPI3)
#define SPI3_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI3)
#define SPI3_SR_TXE_bb						SPIx_SR_TXE_bb(SPI3)
#define SPI3_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI3)

#define SPI4_SR_FRE_bb						SPIx_SR_FRE_bb(SPI4)
#define SPI4_SR_BSY_bb						SPIx_SR_BSY_bb(SPI4)
#define SPI4_SR_OVR_bb						SPIx_SR_OVR_bb(SPI4)
#define SPI4_SR_MODF_bb						SPIx_SR_MODF_bb(SPI4)
#define SPI4_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI4)
#define SPI4_SR_UDR_bb						SPIx_SR_UDR_bb(SPI4)
#define SPI4_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI4)
#define SPI4_SR_TXE_bb						SPIx_SR_TXE_bb(SPI4)
#define SPI4_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI4)

#define SPI5_SR_FRE_bb						SPIx_SR_FRE_bb(SPI5)
#define SPI5_SR_BSY_bb						SPIx_SR_BSY_bb(SPI5)
#define SPI5_SR_OVR_bb						SPIx_SR_OVR_bb(SPI5)
#define SPI5_SR_MODF_bb						SPIx_SR_MODF_bb(SPI5)
#define SPI5_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI5)
#define SPI5_SR_UDR_bb						SPIx_SR_UDR_bb(SPI5)
#define SPI5_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI5)
#define SPI5_SR_TXE_bb						SPIx_SR_TXE_bb(SPI5)
#define SPI5_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI5)

#define SPI6_SR_FRE_bb						SPIx_SR_FRE_bb(SPI6)
#define SPI6_SR_BSY_bb						SPIx_SR_BSY_bb(SPI6)
#define SPI6_SR_OVR_bb						SPIx_SR_OVR_bb(SPI6)
#define SPI6_SR_MODF_bb						SPIx_SR_MODF_bb(SPI6)
#define SPI6_SR_CRCERR_bb					SPIx_SR_CRCERR_bb(SPI6)
#define SPI6_SR_UDR_bb						SPIx_SR_UDR_bb(SPI6)
#define SPI6_SR_CHSIDE_bb					SPIx_SR_CHSIDE_bb(SPI6)
#define SPI6_SR_TXE_bb						SPIx_SR_TXE_bb(SPI6)
#define SPI6_SR_RXNE_bb						SPIx_SR_RXNE_bb(SPI6)

