DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-SPI-bits.h
/*---------------------------------------------------------------------------------------------------------------------+
| SPI_I2SPR - SPI_I2S prescaler register
+---------------------------------------------------------------------------------------------------------------------*/

#define SPI_I2SPR_MCKOE_bit					9
#define SPI_I2SPR_ODD_bit					8
#define SPI_I2SPR_I2SDIV_bit				0
#define SPI_I2SPR_I2SDIV_0_bit				0
#define SPI_I2SPR_I2SDIV_1_bit				1
#define SPI_I2SPR_I2SDIV_2_bit				2
#define SPI_I2SPR_I2SDIV_3_bit				3
#define SPI_I2SPR_I2SDIV_4_bit				4
#define SPI_I2SPR_I2SDIV_5_bit				5
#define SPI_I2SPR_I2SDIV_6_bit				6
#define SPI_I2SPR_I2SDIV_7_bit				7

#define SPI_I2SPR_I2SDIV_0					(1 << SPI_I2SPR_I2SDIV_0_bit)
#define SPI_I2SPR_I2SDIV_1					(1 << SPI_I2SPR_I2SDIV_1_bit)
#define SPI_I2SPR_I2SDIV_2					(1 << SPI_I2SPR_I2SDIV_2_bit)
#define SPI_I2SPR_I2SDIV_3					(1 << SPI_I2SPR_I2SDIV_3_bit)
#define SPI_I2SPR_I2SDIV_4					(1 << SPI_I2SPR_I2SDIV_4_bit)
#define SPI_I2SPR_I2SDIV_5					(1 << SPI_I2SPR_I2SDIV_5_bit)
#define SPI_I2SPR_I2SDIV_6					(1 << SPI_I2SPR_I2SDIV_6_bit)
#define SPI_I2SPR_I2SDIV_7					(1 << SPI_I2SPR_I2SDIV_7_bit)

#define SPIx_I2SPR_MCKOE_bb(base)			BITBAND(&(base)->I2SPR, SPI_I2SPR_MCKOE_bit)
#define SPIx_I2SPR_ODD_bb(base)				BITBAND(&(base)->I2SPR, SPI_I2SPR_ODD_bit)
#define SPIx_I2SPR_I2SDIV_0_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_0_bit)
#define SPIx_I2SPR_I2SDIV_1_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_1_bit)
#define SPIx_I2SPR_I2SDIV_2_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_2_bit)
#define SPIx_I2SPR_I2SDIV_3_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_3_bit)
#define SPIx_I2SPR_I2SDIV_4_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_4_bit)
#define SPIx_I2SPR_I2SDIV_5_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_5_bit)
#define SPIx_I2SPR_I2SDIV_6_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_6_bit)
#define SPIx_I2SPR_I2SDIV_7_bb(base)		BITBAND(&(base)->I2SPR, SPI_I2SPR_I2SDIV_7_bit)

#define SPI1_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI1)
#define SPI1_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI1)
#define SPI1_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI1)

#define SPI2_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI2)
#define SPI2_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI2)
#define SPI2_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI2)

#define SPI3_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI3)
#define SPI3_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI3)
#define SPI3_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI3)

#define SPI4_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI4)
#define SPI4_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI4)
#define SPI4_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI4)

#define SPI5_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI5)
#define SPI5_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI5)
#define SPI5_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI5)

#define SPI6_I2SPR_MCKOE_bb					SPIx_I2SPR_MCKOE_bb(SPI6)
#define SPI6_I2SPR_ODD_bb					SPIx_I2SPR_ODD_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_0_bb				SPIx_I2SPR_I2SDIV_0_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_1_bb				SPIx_I2SPR_I2SDIV_1_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_2_bb				SPIx_I2SPR_I2SDIV_2_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_3_bb				SPIx_I2SPR_I2SDIV_3_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_4_bb				SPIx_I2SPR_I2SDIV_4_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_5_bb				SPIx_I2SPR_I2SDIV_5_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_6_bb				SPIx_I2SPR_I2SDIV_6_bb(SPI6)
#define SPI6_I2SPR_I2SDIV_7_bb				SPIx_I2SPR_I2SDIV_7_bb(SPI6)

#endif /* SOURCE_CHIP_STM32_STM32F4_INCLUDE_DISTORTOS_CHIP_STM32F4_SPI_BITS_H_ */
